#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <errno.h>
#include <sys/types.h>
#include <sys/wait.h>
#include <pthread.h>
// gcc -D_REENTRANT -std=c99 os04_07.c -o os04_07 -lpthread
// ps -eLf
void *thread1(void *arg)
{
    pid_t pid = getpid();
    for (int i = 0; i < 75; i++)
    {
        sleep(1);
        printf("OS04_07_T1: PID = %d-#%d\n", pid, i);
    }
    pthread_exit("Child thread");
}

int main()
{
    pthread_t a_thread;
    void *thread_result;
    pid_t pid = getpid();
    int res = pthread_create(&a_thread, NULL, thread1, NULL);

    for (int i = 0; i < 100; i++)
    {
        
        sleep(1);
        printf("OS04_07: PID =    %d-#%d\n", pid, i);
    }

    int status = pthread_join(a_thread, (void **)&thread_result);
    exit(0);
}





// pthread_t a_thread;: Объявление переменной для идентификатора потока.
// void *thread_result;: Переменная для хранения результата выполнения потока.
// pid_t pid = getpid();: Получение PID (идентификатора процесса) текущего процесса.
// int res = pthread_create(&a_thread, NULL, thread1, NULL);: Создание нового потока. Функция, которая будет выполняться в потоке — thread1.
// for (int i = 0; i < 100; i++) { ... }: Цикл, выполняющийся в главном потоке. Печатает PID и номер итерации цикла, повторяя это 100 раз с паузой в 1 секунду.
// int status = pthread_join(a_thread, (void **)&thread_result);: Главный поток ожидает завершения дочернего потока. После завершения дочернего потока его результат можно будет найти в переменной thread_result.
// exit(0);: Завершение выполнения программы с кодом 0 (успешное выполнение).

// Функция pthread_exit вызывается из дочернего потока и завершает его выполнение, возвращая указатель на строку "Child thread". Это значение может быть получено и использовано в главном потоке, если главный поток вызовет pthread_join (что он и делает в вашем коде).

// int res = pthread_create(&a_thread, NULL, thread1, NULL);
// &a_thread (первый параметр):

// Это указатель на переменную типа pthread_t, в которую будет записан идентификатор нового потока после его успешного создания.
// NULL (второй параметр):

// Это указатель на структуру атрибутов потока. Если передается NULL, используются атрибуты потока по умолчанию. С помощью этой структуры можно задать различные свойства для нового потока, такие как размер стека, приоритет выполнения и т. д.
// thread1 (третий параметр):

// Это указатель на функцию, которая будет выполняться новым потоком. Когда эта функция завершится, поток также завершится.
// NULL (четвертый параметр):

// Это аргумент, который будет передан в функцию потока (thread1 в вашем случае). Если вам не нужно передавать аргументы, можно передать NULL.
// Что касается возвращаемого значения функции pthread_create:

// Если поток успешно создан, pthread_create вернет 0.
// В случае ошибки будет возвращено ненулевое значение. Это значение можно использовать для определения причины ошибки.