#include <iostream>
#include <ctime>

int main()
{
    clock_t t1 = clock();
    int i = 0;
    bool flag1 = true;

    while (true) {
        i++;
        clock_t t2 = clock();
        if (t2 - t1 == 5000 && flag1) {
            std::cout << i << std::endl;
            flag1 = false;
        }
        if (t2 - t1 == 10000 && !flag1) {
            std::cout << i << std::endl;
            flag1 = true;
        }
        if (t2 - t1 == 15000) {
            std::cout << i << std::endl;
            break;
        }
    }
    system("pause");
}










//
//clock_t: clock_t - это тип данных в языке программирования C и C++, который используется для хранения времени, возвращаемого функцией clock().
//
//clock() : Функция clock() возвращает количество тактов процессора, прошедших с момента запуска программы.Это значение может быть использовано для измерения прошедшего процессорного времени между двумя точками в программе.
//
//clock_t t1 = clock(); : Строка кода записывает текущее значение времени(количество тактов процессора) в переменную t1.Таким образом, t1 становится моментом времени, когда эта строка кода была выполнена.