const steggy = require('steggy');
const fs = require('fs');
 

const message = `VakulenchikБольшинство исследований в предметной области посвящено
использованию в качестве стеганоконтейнеров изображений (текст
также можно рассматривать как изображение). Это обусловлено
следующими причинами: 
• относительно большим объемом цифрового представления
изображений, что позволяет внедрять большой объем данных; 
• заранее известным размером контейнера, отсутствием ограничений, накладываемых требованиями реального времени; 
• наличием в большинстве реальных изображений текстурных
областей, имеющих шумовую структуру и хорошо подходящих для
встраивания информации; 
• слабой чувствительностью человеческого глаза к незначительным изменениям цветов изображения, его яркости, контрастности, содержанию в нем шума, искажениям вблизи контуров; 
• хорошо разработанными в последнее время методами цифровой обработки изображений. 
Метод НЗБ основывается на ограниченных способностях зрения или слуха человека, вследствие чего людям тяжело различать
незначительные вариации цвета или звука. Рассмотрим это на примере 24-битного растрового RGB-изображения. Как известно, каждая точка кодируется тремя байтами. Каждый байт определяет интенсивность красного (Red), зеленого (Green) и синего (Blue) 
цветов. Совокупность интенсивностей цвета в каждом из трех каналов определяет оттенок пикселяAndreyVasilyevich`;
const inputImage = fs.readFileSync('./TinyBunny.png');
const password = "test";
 
const concealed = steggy.conceal()(inputImage, message);
fs.writeFileSync('./output.png', concealed);
const outputImage = fs.readFileSync('./output.png');

try {
    const revealed = steggy.reveal()(outputImage);
    
    console.log(revealed.toString());
} catch(ex) {
    console.log(ex.message);
}